const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7',()=>{
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
test('100 + 100 เท่่ากับ 100',()=>{
  expect(sum(100,100)).toBe(200)
})

test('9 + 9 เท่ากับ 18',()=>{
  expect(sum(9,9)).toBe(18)
})

test('8 + 8 เท่ากับ 16',()=>{
  expect(sum(8,8)).toBe(16)
})